Documents/DMS_ОбращениеКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_ОбращениеКлиента</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбращения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_СтатусыОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбращения</Name>
					<Comment>Тип обращения клиента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_СтатусыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НашеОбращениеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НашеОбращениеПричина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодТипОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПодТипыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязаннаяЗаявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_ОбращениеКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подробности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПодробностиОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОщущениеКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ОщущенияКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПожеланиеКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПожеланияКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Риск</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Риски</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроблемнаяСистемаАвто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроблемныеСистемыАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетализацияПроблемыКачества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ДетализацииПроблемКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроблемаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроблемыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерПроблемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ХарактерыПроблемПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовтороноеПриобретенияАвто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектацияАвто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьРешения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроисхождениеОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроисхожденияОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытияОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПричиныЗакрытияОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроблемаПослеПродажногоОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроблемыПослеПродажногоОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрохождениеТО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ПрохождениеТО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеДопОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатныеРемонты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовтороноеПриобретенияАвтоRenault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажиАвто</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СостоянияАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбращенияВДЦ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункциональныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РепутационныеРиски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическиеРиски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗКП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_ЗапросНаКоммерческуюПомощь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействияПоОбращению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_ДействияПоОбращениям</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПланируемая</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполнениеПросрочено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтметкаВыполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОбращение</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияОбщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСообщения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/DMS_ПолучателиОповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ПолучателиОповещения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/DMS_ОбращениеКлиента/Ext/ObjectModule.bsl
Перем КоличествоСтрокДоЗаписи;

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)         	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
		//запишем изменения пробега и ГосНомера
	Если ЗначениеЗаполнено(Автомобиль) тогда
		ТекПробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		ТекПробег = ?(ТекПробег = Неопределено, 0, ТекПробег);
		Если Пробег < ТекПробег тогда
			Сообщить("Вы указали пробег автомобиля меньше существующего!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Подсистема_ОбащенияКлиентов = Справочники.DMS_Подсистемы.ОбращенияКлиентов;
	
	Для каждого Стр из ДействияПоОбращению цикл
		
		// добавляем в регистр событий оповещния только для новых записей в обращении 
		Если Стр.НомерСтроки > КоличествоСтрокДоЗаписи 
			и не ЗначениеЗаполнено(стр.ДатаВыполнения) 
			и стр.Действие.ИспользоватьОповещение тогда
				
				Для каждого Оповещение из стр.Действие.Оповещения цикл
					
					СмещениеВСекундах = Час(Оповещение.МоментОповещения)*60*60+ Минута(Оповещение.МоментОповещения)*60 + Секунда(Оповещение.МоментОповещения);
					
					Если СмещениеВСекундах <> 0 и (Стр.ДатаПланируемая - СмещениеВСекундах) < ТекущаяДата() тогда
						Продолжить; // не будем делать оповещния для событий в прошлом времени.
					КонецЕсли;
					
					НомерСобытия = DMS_ОбращенияКлиентов.ПолучитьНомерСобытия();
					
					Набор = РегистрыСведений.dms_ЖурналСобытий.СоздатьНаборЗаписей();
					Набор.Отбор.Подсистема.Установить(Подсистема_ОбащенияКлиентов);
					Набор.Отбор.Событие.Установить(стр.Действие);
					Набор.Отбор.СпособОповещения.Установить(Оповещение.СпособОповещения);
					Набор.Отбор.РегистраторСобытия.Установить(Ссылка);
					Набор.Отбор.НомерСобытия.Установить(НомерСобытия);
					
					Запись = Набор.Добавить();
					Запись.Подсистема = Подсистема_ОбащенияКлиентов;
					Запись.Событие = Стр.Действие;
					Запись.СпособОповещения = Оповещение.СпособОповещения;
					Запись.РегистраторСобытия = Ссылка;
					Запись.НомерСобытия = НомерСобытия;
					Запись.Клиент = Контрагент;
					
					Запись.ДатаОповещения = Стр.ДатаПланируемая - СмещениеВСекундах;
					Запись.ТекстОповещения = ПодготовитьТекстНапоминания(Ссылка, Стр,Оповещение.ШаблонОповещения); 
					
					Если Оповещение.ПолучательОповещения = Перечисления.DMS_ПолучателиОповещения.Исполнитель тогда
						Запись.ОбъектОповещения = Стр.Исполнитель;	
					ИначеЕсли Оповещение.ПолучательОповещения = Перечисления.DMS_ПолучателиОповещения.Клиент тогда
						Запись.ОбъектОповещения = Контрагент;
					КонецЕсли;
					Запись.Приоритет= Ссылка.Приоритет;
					
					Набор.Записать(Истина);

				КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	
	//запишем изменения пробега и ГосНомера
	Если ЗначениеЗаполнено(Автомобиль) тогда
		
		ТекПробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		ТекПробег = ?(ТекПробег = Неопределено, 0, ТекПробег);
		Если Пробег > ТекПробег тогда
			Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(Автомобиль, Пробег,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ТекущаяДата());
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГосНомер) тогда
			Если ГосНомер <> Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер) тогда
				Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(Автомобиль, ГосНомер,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ТекущаяДата());
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)      	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	Для каждого Стр из ДействияПоОбращению цикл
		
		Если не ЗначениеЗаполнено(Стр.ДатаПланируемая) тогда
			
			Сообщить("Необходимо указать планируемую дату для действия """+ Стр.Действие+ """");
			Отказ = Истина;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;		
	
	КоличествоСтрокДоЗаписи = Ссылка.ДействияПоОбращению.Количество();
	
	
	Если ДействияПоОбращению.Количество()=0 
		или ДействияПоОбращению.Получить(0).Действие <> Справочники.DMS_ДействияПоОбращениям.НазначитьИсполнителя тогда
		Сообщить("Для сохранения обращения необходимо указать первое действие ""Назначить исполнителя""");
		Отказ = Истина;
		Возврат;
	КонецЕсли;		
	
	Если ЗначениеЗаполнено(Автомобиль) Тогда
		Если ЗначениеЗаполнено(ГосНомер) тогда
			Если ПроверкаГосНомера(ГосНомер) тогда
				Сообщить("Ошибка гос. номер может содержать только цифры и буквы латинского алфавита.");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


Функция ПроверкаГосНомера(ГосНомер)
	
	//Для х=0 по СтрДлина(ГосНомер) цикл
	//	ТекСимвол = Сред(ГосНомер,х,1);
	//	Если НЕ КодСимвола(ТекСимвол)= 32  //пробел
	//		и НЕ (КодСимвола(ТекСимвол)>47 и КодСимвола(ТекСимвол)<58) //цифры
	//		и НЕ (КодСимвола(ТекСимвол)>64 и КодСимвола(ТекСимвол)<91) //большие латинские буквы
	//		и НЕ (КодСимвола(ТекСимвол)>96 и КодСимвола(ТекСимвол)<123) //маленькие латинские буквы
	//		Тогда
	//			Возврат Истина;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Возврат Ложь;
	
	Возврат Ложь;
	
КонецФункции

Функция ПодготовитьТекстНапоминания(Ссылка,Стр,ТекстНапоминания);
	
	ДатаОкончания = Стр.ДатаПланируемая + Час(Стр.Действие.ДлительностьДействия) * 60 * 60 + Минута(Стр.Действие.ДлительностьДействия) * 60 + Секунда(Стр.Действие.ДлительностьДействия);
	Текст = СтрЗаменить(ТекстНапоминания,"&НомерОбращения",Ссылка.Номер);
	Текст = СтрЗаменить(Текст,"&ДатаОбращения",Ссылка.Дата);
	Текст = СтрЗаменить(Текст,"&ДатаОкончания",Строка(ДатаОкончания));
	Текст = СтрЗаменить(Текст,"&ДатаПланируемая",Строка(Стр.ДатаПланируемая));
	Текст = СтрЗаменить(Текст,"&Фамилия",Ссылка.Контрагент.Фамилия);
	Текст = СтрЗаменить(Текст,"&Имя",Ссылка.Контрагент.Имя);
	Текст = СтрЗаменить(Текст,"&Отчество",Ссылка.Контрагент.Отчество);
	Текст = СтрЗаменить(Текст,"&Исполнитель",Стр.Исполнитель);
	Возврат Текст;
	
КонецФункции
